### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

creating a list which contain the data

In [2]:
data=[4,8,15,16,23,42]

creating a *Pandas Series* and printing it's elements

In [3]:
import pandas as pd
series=pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

**creating a variable of list type which contian the 10 contries name as list element**

In [4]:
contries_list=['India','China','US','Finland','Germany','Denmark','Franch','Thailand','Singapore','Australia']

For applying *pandas.Series* function to the list variable **contries_list**

In [5]:
contries=pd.Series(contries_list)

print(contries)

0        India
1        China
2           US
3      Finland
4      Germany
5      Denmark
6       Franch
7     Thailand
8    Singapore
9    Australia
dtype: object

### Q3. Create a Pandas DataFrame that contains the following data:

In [6]:
data1={
           'Name':['Alice','Bob','Claire'],
           'Age':[25,30,27],
           'Gender':['Female','Male','Female']
           }

In [7]:
dataframe=pd.DataFrame(data1)

In [8]:
print(dataframe)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas **DataFrame** is a Two-Dimentional data structure, it hold's data of multiple type's like int,string,boolean,list. it hold's data in a Tabular Format like a Sql, in a Row's and column's.  
where's the **pandas.series** is a one dimentional data strucure , it hold's data of multiple type's like int,string ,boolean, list. it hold's data like element's in list, array and the data of one column

#### Example:
opening a random file of a DataFrame type and extracting a data from it using padas function pandas.Series

In [9]:
file=pd.read_csv('sample1.csv')
print(type(file))
print(file)

<class 'pandas.core.frame.DataFrame'>
  Month   "Average"   "2005"   "2006"   "2007"   "2008"   "2009"   "2010"  \
0   May         0.1        0        0        1        1        0        0
1   Jun         0.5        2        1        1        0        0        1
2   Jul         0.7        5        1        1        2        0        1
3   Aug         2.3        6        3        2        4        4        4
4   Sep         3.5        6        4        7        4        2        8
5   Oct         2.0        8        0        1        3        2        5
6   Nov         0.5        3        0        0        1        1        0
7   Dec         0.0        1        0        1        0        0        0

    "2011"   "2012"   "2013"   "2014"   "2015"
0        0        2        0        0        0
1        1        2        2        0        1
2        3        0        2        2        1
3        7        8        2        2        3
4        5        2        5        2        5
5        1        5        2        3        0
6        1        0        1        0        1
7        0        0        0        0        1

**Extracting data in a series from the dataframe**

In [10]:
file["Month"]

0    May
1    Jun
2    Jul
3    Aug
4    Sep
5    Oct
6    Nov
7    Dec
Name: Month, dtype: object

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions

There is a sevaral function in Pandas which is used to manipulate data in in a DataFrame like ,head(), tail(),info(),describe()  

**Example:-**  
**head()** function is print the data of first 5 row

In [24]:
ex=pd.read_csv('sample1.csv')
ex.head()

,Month,"""Average""","""2005""","""2006""","""2007""","""2008""","""2009""","""2010""","""2011""","""2012""","""2013""","""2014""","""2015"""
0,May,0.1,0,0,1,1,0,0,0,2,0,0,0
1,Jun,0.5,2,1,1,0,0,1,1,2,2,0,1
2,Jul,0.7,5,1,1,2,0,1,3,0,2,2,1
3,Aug,2.3,6,3,2,4,4,4,7,8,2,2,3
4,Sep,3.5,6,4,7,4,2,8,5,2,5,2,5

***tail()** function print the data of last 5 row's

In [25]:
ex.tail()

,Month,"""Average""","""2005""","""2006""","""2007""","""2008""","""2009""","""2010""","""2011""","""2012""","""2013""","""2014""","""2015"""
3,Aug,2.3,6,3,2,4,4,4,7,8,2,2,3
4,Sep,3.5,6,4,7,4,2,8,5,2,5,2,5
5,Oct,2.0,8,0,1,3,2,5,1,5,2,3,0
6,Nov,0.5,3,0,0,1,1,0,1,0,1,0,1
7,Dec,0.0,1,0,1,0,0,0,0,0,0,0,1

**describe()** function give's the discription of all the **int** datatype like mean,std,min

In [26]:
ex.describe()

,"""Average""","""2005""","""2006""","""2007""","""2008""","""2009""","""2010""","""2011""","""2012""","""2013""","""2014""","""2015"""
count,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000,8.00000,8.000000,8.000000,8.000000,8.000000
mean,1.200000,3.875000,1.125000,1.750000,1.875000,1.125000,2.375000,2.25000,2.375000,1.750000,1.125000,1.500000
std,1.254705,2.799872,1.552648,2.187628,1.642081,1.457738,2.973094,2.54951,2.825269,1.581139,1.246423,1.690309
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,0.000000,0.000000
25%,0.400000,1.750000,0.000000,1.000000,0.750000,0.000000,0.000000,0.75000,0.000000,0.750000,0.000000,0.750000
50%,0.600000,4.000000,0.500000,1.000000,1.500000,0.500000,1.000000,1.00000,2.000000,2.000000,1.000000,1.000000
75%,2.075000,6.000000,1.500000,1.250000,3.250000,2.000000,4.250000,3.50000,2.750000,2.000000,2.000000,1.500000
max,3.500000,8.000000,4.000000,7.000000,4.000000,4.000000,8.000000,7.00000,8.000000,5.000000,3.000000,5.000000

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

**Series:-** is a mutable in nature, means we can modify the series after the creation. it's a one dimentional data structure & copable holding the data of any type.  

**DataFrame:-** is also a mutable in nature, we can also modify it's data after the creation. it is a two dimentional data structure & capable of holding the data of any type. same as series dataframe  

**Panel:-** panel is a immutable in nature, means we can't modify it's data after the creation. Panel is a 3D container of data and were a part of earlier version of pandas to handle 3D dimentional data, but the panel have been deprecated since version 0.25 and are considered immutable. instead of 3D data pandas recommnds using multiindex DataFrame or xarray

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [18]:
Name=['Shreyansh',"Swaraj","Raj","Sibbu"]
Age=[18,20,20,18]
Location=['Mumbai',"Agara","indore","chennai"]

In [19]:
b_list=[]
DataFrame=pd.DataFrame(b_list)

DataFrame['Name']=pd.Series(Name)
DataFrame["Age"]=pd.Series(Age)
DataFrame['Location']=pd.Series(Location)

In [20]:
DataFrame['Name']=pd.Series(Name)
DataFrame["Age"]=pd.Series(Age)
DataFrame['Location']=pd.Series(Location)

In [21]:
DataFrame

        Name  Age Location
0  Shreyansh   18   Mumbai
1     Swaraj   20    Agara
2        Raj   20   indore
3      Sibbu   18  chennai